src/cf/Documents/Корреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Корреспонденция</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКорреспонденции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбращения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбращенийГраждан</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовоКВыгрузкеССТУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонтрагента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПереадресовавшего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеОбращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичноеОбращение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переадресовавший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Создал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияПервоначальный</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтветаПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтветПереадресовавшему</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДубликатОбращения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПовторноеОбращение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыОбращения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтвета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВопроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнениеАвтораОМерах</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнениеАвтораОРезультатах</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганДляПередачи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатРассмотрения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыРассмотренияОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТемыОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тематика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТематикиОбращений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Корреспонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Корреспондент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адресат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОтправки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонтрагента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКонтрагента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/ВидыКорреспонденции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыКорреспонденции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/Корреспонденция/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Если Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание) Тогда 
			Объект.Основание = Параметры.Основание;
		КонецЕсли;
		
		УчетВходящейКорреспонденции = Ложь; УчетИсходящейКорреспонденции = Ложь;
		Если Параметры.Свойство("УчетВходящейКорреспонденции") И Параметры.Свойство("УчетИсходящейКорреспонденции") Тогда 
			УчетВходящейКорреспонденции = Параметры.УчетВходящейКорреспонденции;
			УчетИсходящейКорреспонденции = Параметры.УчетИсходящейКорреспонденции;
		ИначеЕсли ЗначениеЗаполнено(Объект.Основание) Тогда 
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание,
				"ВидДокумента.ЯвляетсяВходящейКорреспонденцией, ВидДокумента.ЯвляетсяИсходящейКорреспонденцией");
			УчетВходящейКорреспонденции = Реквизиты.ВидДокументаЯвляетсяВходящейКорреспонденцией;
			УчетИсходящейКорреспонденции = Реквизиты.ВидДокументаЯвляетсяИсходящейКорреспонденцией;
		КонецЕсли;
		
		Если УчетВходящейКорреспонденции = Истина И Не УчетИсходящейКорреспонденции = Истина Тогда 
			Объект.ВидКорреспонденции = Перечисления.ВидыКорреспонденции.Входящая;
			Элементы.ВидКорреспонденции.Доступность = Ложь;
		ИначеЕсли Не УчетВходящейКорреспонденции = Истина И УчетИсходящейКорреспонденции = Истина Тогда 
			Объект.ВидКорреспонденции = Перечисления.ВидыКорреспонденции.Исходящая;
			Элементы.ВидКорреспонденции.Доступность = Ложь;
		ИначеЕсли Не УчетВходящейКорреспонденции = Истина И Не УчетИсходящейКорреспонденции = Истина Тогда 
			СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	Иначе 
		Элементы.ВидКорреспонденции.Доступность = Ложь;
		Элементы.Основание.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.Корреспонденты.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(
			ЭтаФорма,
			Объект.Корреспонденты[0],
			"Отправлен, 
			|ДатаОтправки, 
			|СпособОтправки"); 
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Корреспонденты.Очистить();
	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Основание,
		"ВидДокумента.ВестиУчетСторон, ВидДокумента.ВестиУчетПоКонтрагентам, Контрагенты, Стороны");
	Если РеквизитыОснования.ВидДокументаВестиУчетСторон = Истина Тогда
		ВыборкаСтороны = РеквизитыОснования.Стороны.Выбрать();
		Пока ВыборкаСтороны.Следующий() Цикл 
			Если ЗначениеЗаполнено(ВыборкаСтороны.Сторона) 
				И ТипЗнч(ВыборкаСтороны.Сторона) = Тип("СправочникСсылка.Контрагенты")
				И ЗначениеЗаполнено(ВыборкаСтороны.Сторона) Тогда 
				НоваяСтрока = ТекущийОбъект.Корреспонденты.Добавить();
				НоваяСтрока.Корреспондент = ВыборкаСтороны.Сторона;
				НоваяСтрока.СпособОтправки = СпособОтправки;
				НоваяСтрока.Отправлен = Отправлен;
				НоваяСтрока.ДатаОтправки = ДатаОтправки;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли РеквизитыОснования.ВидДокументаВестиУчетПоКонтрагентам = Истина Тогда
		ВыборкаКонтрагенты = РеквизитыОснования.Контрагенты.Выбрать();
		Пока ВыборкаКонтрагенты.Следующий() Цикл
			НоваяСтрока = ТекущийОбъект.Корреспонденты.Добавить();
			НоваяСтрока.Корреспондент = ВыборкаКонтрагенты.Контрагент;
			НоваяСтрока.СпособОтправки = СпособОтправки;
			НоваяСтрока.Отправлен = Отправлен;
			НоваяСтрока.ДатаОтправки = ДатаОтправки;
		КонецЦикла;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ЭтоНовыйОбъект", НЕ ЗначениеЗаполнено(ТекущийОбъект.Ссылка));
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда 
		РеквизитыПоСсылке = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Ссылка, 
			"РегистрационныйНомер, ДатаРегистрации, НомерКонтрагента, ДатаКонтрагента")
	Иначе 
		РеквизитыПоСсылке = Новый Структура;
		РеквизитыПоСсылке.Вставить("РегистрационныйНомер", "");
		РеквизитыПоСсылке.Вставить("ДатаРегистрации", Дата(1, 1, 1));
		РеквизитыПоСсылке.Вставить("НомерКонтрагента", "");
		РеквизитыПоСсылке.Вставить("ДатаКонтрагента", Дата(1, 1, 1));
	КонецЕсли;
	
	Если Не ПараметрыЗаписи.ЭтоНовыйОбъект И Модифицированность 
		И (ТекущийОбъект.РегистрационныйНомер <> РеквизитыПоСсылке.РегистрационныйНомер
			Или ТекущийОбъект.ДатаРегистрации <> РеквизитыПоСсылке.ДатаРегистрации
			Или ТекущийОбъект.НомерКонтрагента <> РеквизитыПоСсылке.НомерКонтрагента
			Или ТекущийОбъект.ДатаКонтрагента <> РеквизитыПоСсылке.ДатаКонтрагента) Тогда 
		ПараметрыЗаписи.Вставить("ИзменилисьРеквизиты", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.ЭтоНовыйОбъект Или 
		ПараметрыЗаписи.Свойство("ИзменилисьРеквизиты") И ПараметрыЗаписи.ИзменилисьРеквизиты Тогда 
		СтруктураОповещения = Новый Структура("Документ, Корреспонденция", Объект.Основание, Объект.Ссылка);
		Оповестить("ЗаписанаКорреспонденция", СтруктураОповещения); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Если Объект.ВидКорреспонденции = ПредопределенноеЗначение("Перечисление.ВидыКорреспонденции.Входящая") Тогда 
		Элементы.НомерКонтрагента.Заголовок = НСтр("ru = 'Исходящий №'");
		Элементы.СпособПолучения.Видимость = Истина;
		Элементы.СпособОтправки.Видимость = Ложь;
		Элементы.ГруппаОтправленДата.Видимость = Ложь;
	Иначе 
		Элементы.НомерКонтрагента.Заголовок = НСтр("ru = '№ получателя'");
		Элементы.СпособПолучения.Видимость = Ложь;
		Элементы.СпособОтправки.Видимость = Истина;
		Элементы.ГруппаОтправленДата.Видимость = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидКорреспонденцииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры
